ftoralesacosta/esp32-Matter-Over-Thread/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

# libsodium
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# NIMBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=70
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=n

# FreeRTOS should use legacy API
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# Enable OpenThread and Optimize Reliability (Minimal Thread Device)
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_FTD=n
CONFIG_OPENTHREAD_MTD=y
CONFIG_OPENTHREAD_RADIO=n
CONFIG_OPENTHREAD_RX_ON_WHEN_IDLE=y
CONFIG_OPENTHREAD_NUM_MESSAGE_BUFFERS=100
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n

# Disable lwip ipv6 autoconfig
CONFIG_LWIP_IPV6_AUTOCONFIG=n

# Use a custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# XIAO ESP32-C6 has 4MB flash. This was previously only set in the committed
# sdkconfig (never in this defaults file), so removing that stale sdkconfig
# silently reverted the build to the 2MB IDF default and broke the partition
# table (partitions.csv sizes to ~3.9MB).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# CHIP's crypto layer (CHIPCryptoPALmbedTLS) calls mbedtls_hkdf directly, but
# mbedtls only builds it in if HKDF_C is enabled. Same story as the flash
# size above: this was only ever set in the committed sdkconfig, never here,
# so removing that stale sdkconfig broke the final link step with
# "undefined reference to `mbedtls_hkdf'".
CONFIG_MBEDTLS_HKDF_C=y

# LwIP config for OpenThread
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# MDNS platform
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# CONFIG_USE_MINIMAL_MDNS defaults to y in CHIP's Kconfig. Commit d17ea4d set
# it explicitly (mistakenly believing it helped Thread SRP discovery), and
# f980c23 tried to "revert" that by just removing the line - but since the
# Kconfig default is also y, that revert was a no-op and minimal mDNS stayed
# active the whole time. Minimal mDNS (Advertiser_ImplMinimalMdns.cpp) only
# broadcasts on the local Thread mesh and has no SRP integration at all
# (verified: zero references to SRP in that file), so it never reaches
# HomeKit on the WiFi side - Apple's Thread border routers rely on SRP
# registration + their Advertising Proxy, not raw multicast reflection. This
# was silently causing every commissioning attempt to hang after Thread
# attach: credentials all succeed, the device thinks it "published" mDNS
# locally, but the operational record never reaches the LAN, so the
# commissioner can never open a CASE session and commissioning times out via
# the fail-safe timer. Setting this to n switches the build to chip_mdns=
# "platform", which compiles ESP32's DnssdImpl.cpp + OpenThreadDnssdImpl.cpp
# and actually registers via the OpenThread SRP client (AddSrpService) -
# already enabled via CONFIG_OPENTHREAD_SRP_CLIENT=y above.
CONFIG_USE_MINIMAL_MDNS=n

# Enable OTA Requestor
CONFIG_ENABLE_OTA_REQUESTOR=y

# Disable Wi-Fi for C6 when running in Thread mode
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_ENABLE_WIFI_AP=n

# Button
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_LONG_PRESS_TIME_MS=5000

# This branch (feature/fan_with_dial) exists to build and test rotary
# encoder support, so it defaults to enabled here. The Kconfig option itself
# defaults to n (see main/Kconfig.projbuild), so a build on main or any
# other branch without this line stays dial-free.
CONFIG_ENABLE_ROTARY_ENCODER=y

# Enable chip shell
CONFIG_ENABLE_CHIP_SHELL=y

# Enable persist subscriptions
CONFIG_ENABLE_PERSIST_SUBSCRIPTIONS=y

# MRP configs
CONFIG_MRP_LOCAL_ACTIVE_RETRY_INTERVAL_FOR_THREAD=2000
CONFIG_MRP_LOCAL_IDLE_RETRY_INTERVAL_FOR_THREAD=2000
CONFIG_MRP_RETRY_INTERVAL_SENDER_BOOST_FOR_THREAD=2000
CONFIG_MRP_MAX_RETRANS=3

# ESP32-C6-DevKitC-1 Settings
# Buttons
CONFIG_BSP_BUTTONS_NUM=1
CONFIG_BSP_BUTTON_1_TYPE_GPIO=y
CONFIG_BSP_BUTTON_1_GPIO=9
CONFIG_BSP_BUTTON_1_LEVEL=0

